tests/Mock/PurchaseCompleteSuccess.txt

HTTP/2 200
server: nginx
date: Fri, 30 Aug 2019 17:08:20 GMT
content-type: application/json
vary: Accept-Encoding
vary: Accept-Encoding
x-powered-by: PHP/7.0.7
cache-control: private, must-revalidate
pragma: no-cache
expires: -1

{"result": {"status": 0, "message": "عملیات با موفقیت انجام شد", "level": "INFO"}, "trackingCode": "19259313601650191846745", "providerId": "132713002000200010", "fpCode": "7", "fpName": "DIGIPAY", "amount": 200000, "paymentGateway": 4, "additionalInfo": {"prepaymentAmount": 0, "cashAmount": 0, "creditAmount": 200000, "instantFinalization": false, "generateInvoice": false}}

